---
kind: enumMember
id: F:Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.StartServiceSwapOutMode
enum: Autodesk.Revit.UI.Events.FabricationPartBrowserOperation
source: html/2e6ebb20-ac7c-2e91-28f7-0e232a983cc8.htm
---
# Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.StartServiceSwapOutMode

Start service swap-out mode